{
  "enigmas": [
    {
      "link": "https://web.archive.org/web/20120520135456/http:/geniusbr.tripod.com/bengala.html",
      "titulo": "GeniusLand - Enigmas - Adão & Eva",
      "dificuldade": "Enredo",
      "versao": "1.0",
      "contexto": "Um jovem aventureiro que andava pelas baixas temperaturas do polo ártico, vê dois corpos dentro de um iceberg. Aproximando-se mais perto do iceberg, ele grita 'São eles !!! Encontrei Adão & Eva'. Como jovem tinha tanta certeza que aqueles dois corpos eram mesmo de Adão e Eva ?",
      "solucao": "Pela Bíblia... Adão e Eva foram os únicos humanos que não nasceram de uma gestação. Em outras palavras, todo ser humano além deles, tiveram umbigo por terem nascido de um outro ser humano. O esperto rapaz logo notou isso e tirou a brilhante conclusão.",
      "comentarios": "O jovem estava totalmente lúcido quando berrou tal frase. Os efeitos da temperatura não afetaram em nada as condições mentais do rapaz, o único fato que a baixa temperatura aqui influi é de que ela conseguiu preservar os corpos de Adão e Eva mesmo depois de tantos milênios."
    },
    {
      "link": "https://web.archive.org/web/20120520135456/http:/geniusbr.tripod.com/ilha.html",
      "titulo": "GeniusLand - Enigmas - Frigorífico Assassino",
      "dificuldade": "Enredo",
      "versao": "1.0",
      "contexto": "O dono de uma grande rede de frigoríficos é encontrado morto dentro de um de seus frigoríficos. A polícia desconfiou logo que se tratava de um homicídio pelas circunstâncias do crime. O homem tinha muitos problemas e foi encontrado pendurado pelo pescoço a uma altura de três metros dentro de um frigorífico desligado. Mas para esclarecer de vez com o caso um famoso detetive foi chamado, e ao ver a cena do crime logo disse... 'Não amigos, o que houve aqui foi um suicídio. Aquela poça de água embaixo do cadáver é a prova!!!'",
      "solucao": "O dono desta rede de frigoríficos estava passando por diversos problemas, com a família e com os negócios, por isso resolver se matar da seguinte forma: ele subiu em cima de um imenso cubo de gelo que havia no frigorífico, amarrou uma corda no teto e desligou o frigorífico. Depois disso ele subiu de novo em cima do cubo de gelo e esperou o gelo derreter-se para que ele pudesse ficar suspenso no ar. A poça de água foi o que sobrou do cubo de gelo.",
      "comentarios": "O detetive logo percebeu a situação peculiar e concluiu o caso com a poça de água deixada pelo cubo de gelo derretido."
    },
    {
      "link": "https://web.archive.org/web/20120520135456/http:/geniusbr.tripod.com/corredor.html",
      "titulo": "GeniusLand - Enigmas - A Ilha dos Sem Braços",
      "dificuldade": "Enredo",
      "versao": "1.0",
      "contexto": "Quatro sobreviventes de um naufrágio foram encontrados vivos numa ilha deserta depois de um mês do acidente, junto com alguns objetos pessoais salvos... Dois dos sobreviventes deles sem um dos braços, outro sem um braço e uma perna e o quarto com todos os membros. Porque eles foram encontrados desta forma?",
      "solucao": "No começo da permanência na ilha eles estavam conseguindo sobreviver com a água salgada do oceano que eles tratavam. Mas como estavam demorando para encontrá-los, eles famintos tiveram como a única oportunidade de sobrevivência partir para o canibalismo. Como eles queriam continuar vivos, eles precisavam amputar parte do corpo com cuidado para evitar talvez um derrame. E pela sorte deles um dos sobreviventes era médico, ou seja, sabia arrancar parte do corpo de modo que não houvesse complicações. Assim começaram a comer os braços... um, dois, três braços. Quando chegou a vez do braço do médico eles acharam melhor não cortar nada dele porque ele era o único que precisava de mobilidade para realizar as 'cirurgias' enquanto o resgate não chegava.",
      "comentarios": "É importante ressaltar que todos chegaram inteiros na ilha logo após o naufrágio e que a escolha de quem teria o membro cortado era feita na sorte e não por um motivo lógico. Para se descobrir porque um dos sobreviventes não teve nada amputado, a resposta está na profissão dele, que é um motivo social."
    },
    {
      "link": "https://web.archive.org/web/20120520135456/http:/geniusbr.tripod.com/faisao.html",
      "titulo": "GeniusLand - Enigmas - Corredor Vaga-Lume",
      "dificuldade": "Enredo",
      "versao": "1.0",
      "contexto": "Um homem passa correndo dentro de um corredor nos Estados Unidos com um papel na mão, quando de repente a iluminação do corredor pisca. A reação do homem é imediata, ele se vira e volta andando. Por que ele teve tal reação?",
      "solucao": "O cenário da ação é o seguinte... um advogado que estava defendendo um preso condenado à morte na cadeira elétrica, corre num corredor dentro de uma prisão. O advogado estava levando um documento que cancelava a execução do preso. Acontece que o preso seria morto alguns instantes a seguir e o advogado precisava correr para chegar a tempo. Quando a luz piscou o advogado parou, porque sabia que não adiantava mais nada, o preso já estava morto.",
      "comentarios": "Por que essa situação nunca iria ocorrer no Brasil? Basta você pensar nas diferenças entre os dois países, tanto econômicas e culturais. Em alguns estados americanos eles permitem a pena de morte na cadeira elétrica, aqui no Brasil não."
    },
    {
      "link": "https://web.archive.org/web/20120520135456/http:/geniusbr.tripod.com/piano.html",
      "titulo": "GeniusLand - Enigmas - Canibalismo Inconsciente",
      "dificuldade": "Enredo",
      "versao": "1.0",
      "colaboracao": "Ricardo Grillo",
      "contexto": "Um casal entra em um restaurante, sentam-se e pedem faisão. O faisão chega e ao colocá-lo na boca o homem desmaia. Por quê?",
      "solucao": "Aquella seria a segunda vez que o homem comera faisão. A primeira foi logo após um naufrágio, no qual estava presente, muito tempo atrás quando ainda era casado com a sua primeira esposa. Logo após o naufrágio, isolados numa ilha, o grupo faminto foi atrás de comida. Nisso ele havia perdido a amada durante a procura. Quando um grupo retornou trouxe consigo uma carne..."
    }
  ]
}
